

// export default function SqaureGridText() {
//   return (
//     <h1 className="text-4xl mb-4 drop-shadow-[0_0_10px_#3b82f3] font-pixel text-blue-400 tracking-widest">
//       Hybrid  Retrieval <span className="underline decoration-white underline-offset-4"> Platform</span> 
//     </h1>
//   );
// }

export default function SqaureGridText() {
  return (
    // <h1 className="text-4xl mb-4 drop-shadow-[0_0_10px_#3b82f3] font-pixel text-blue-400 tracking-widest">
    //   Hybrid  Retrieval <span className="underline decoration-white underline-offset-4"> Platform</span> 
    // </h1>
    <div className="flex items-center justify-center">
            <pre className="hero-ascii  monospace leading-tight mb-4 drop-shadow-[0_0_10px_#3b22f3] text-blue-400 tracking-widest">
{` ██████╗ ██╗   ██╗███████╗██████╗ ██╗   ██╗     █████╗ ████████╗██╗      █████╗ ███████╗
██╔═══██╗██║   ██║██╔════╝██╔══██╗╚██╗ ██╔╝    ██╔══██╗╚══██╔══╝██║     ██╔══██╗██╔════╝
██║   ██║██║   ██║█████╗  ██████╔╝ ╚████╔╝     ███████║   ██║   ██║     ███████║███████╗
██║▄▄ ██║██║   ██║██╔══╝  ██╔══██╗  ╚██╔╝      ██╔══██║   ██║   ██║     ██╔══██║╚════██║
╚██████╔╝╚██████╔╝███████╗██║  ██║   ██║       ██║  ██║   ██║   ███████╗██║  ██║███████║
 ╚══▀▀═╝  ╚═════╝ ╚══════╝╚═╝  ╚═╝   ╚═╝       ╚═╝  ╚═╝   ╚═╝   ╚══════╝╚═╝  ╚═╝╚══════╝`}

    </pre>
    </div>
    
  );
}